<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pemilihan kolom (columns selection) pada Pandas Data Frame berdasarkan tipe data**

Import Library

In [6]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype(float)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         13.0         11    A
1 2000-01-01 01:00:00          4.0         18    B
2 2000-01-01 02:00:00         10.0         13    C
3 2000-01-01 03:00:00          9.0         12    D
4 2000-01-01 04:00:00          9.0         15    E

In [8]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

Memilih Kolom dengan Tipe Data Numerik

In [9]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         13.0         11
1          4.0         18
2         10.0         13
3          9.0         12
4          9.0         15

Memilih Kolom dengan Tipe Data Float

In [10]:
df.select_dtypes(include='float')

   bil_pecahan
0         13.0
1          4.0
2         10.0
3          9.0
4          9.0

Memilih Kolom dengan Tipe Data Integer

In [11]:
df.select_dtypes(include='int')

   bil_bulat
0         11
1         18
2         13
3         12
4         15

Memilih Kolom dengan Tipe Data String / Object

In [12]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

Memilih Kolom dengan Tipe Data datetime

In [13]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

Memilih Kolom dengan Kombinasi Tipe Data

In [14]:
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0         13.0         11    A
1          4.0         18    B
2         10.0         13    C
3          9.0         12    D
4          9.0         15    E